In [1]:
pip install mysql-connector-python

Defaulting to user installation because normal site-packages is not writeable
Collecting mysql-connector-python
  Downloading mysql_connector_python-9.4.0-cp310-cp310-win_amd64.whl (16.4 MB)
     --------------------------------------- 16.4/16.4 MB 10.2 MB/s eta 0:00:00
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-9.4.0
Note: you may need to restart the kernel to use updated packages.

In [2]:
import mysql.connector 

cnx = mysql.connector.connect(user='root', password='Student123@', host='127.0.0.1', database='university')

In [3]:
#cursor makes it possible to do the sql consultations in python 
#execute will execute queries 

import pandas as pd 

cursor = cnx.cursor()
cursor.execute('SELECT * FROM STUDENT')
for x in cursor:
    print(x)

('S001', 'MICHAEL BEVAN', datetime.date(1960, 9, 15), Decimal('3.20'), 'CHATSWOOD')
('S002', 'BRIAN LARA', datetime.date(1965, 2, 10), Decimal('4.00'), 'MARSFIELD')
('S003', 'VIVAN RICHARDS', datetime.date(1958, 11, 12), Decimal('4.50'), 'BURWOOD')
('S004', 'JAVED MIANDAD', datetime.date(1966, 5, 5), Decimal('3.50'), 'RYDE')
('S005', 'VIRAT KOHLI', datetime.date(1988, 10, 15), Decimal('4.30'), 'AUBURN')
('S006', 'BABAR AZAM', datetime.date(1991, 4, 20), Decimal('4.20'), 'LAKEMBA')
('S007', 'KUMARAN SANGAKARA', datetime.date(1980, 1, 26), Decimal('3.70'), 'REDFERN')

In [5]:
import warnings
warnings.filterwarnings("ignore")

print("***** query output presented as a pands dataframe *****")
print("\n")
df = pd.read_sql_query("select * from STUDENT ", cnx)
print(df)

***** query output presented as a pands dataframe *****


  STUDENTID        STUDENTNAME  STUDENTDOB  STUDENTGPA STUDENTSUBURB
0      S001      MICHAEL BEVAN  1960-09-15         3.2     CHATSWOOD
1      S002         BRIAN LARA  1965-02-10         4.0     MARSFIELD
2      S003     VIVAN RICHARDS  1958-11-12         4.5       BURWOOD
3      S004      JAVED MIANDAD  1966-05-05         3.5          RYDE
4      S005        VIRAT KOHLI  1988-10-15         4.3        AUBURN
5      S006         BABAR AZAM  1991-04-20         4.2       LAKEMBA
6      S007  KUMARAN SANGAKARA  1980-01-26         3.7       REDFERN

In [6]:
query = """SELECT STUDENTNAME, STUDENTGPA
FROM STUDENT
ORDER BY STUDENTGPA DESC""" 

df1 = pd.read_sql_query(query, cnx)
print(df1)

         STUDENTNAME  STUDENTGPA
0     VIVAN RICHARDS         4.5
1        VIRAT KOHLI         4.3
2         BABAR AZAM         4.2
3         BRIAN LARA         4.0
4  KUMARAN SANGAKARA         3.7
5      JAVED MIANDAD         3.5
6      MICHAEL BEVAN         3.2

In [7]:
df2 = pd.read_sql_query('select * from teacher order by teacherdesignation, teachersalary', cnx)
print(df2)

  TEACHERID       TEACHERNAME   TEACHERDESIGNATION  TEACHERSALARY
0      T005    LARNCE KLUSNER            ASSOCIATE         150000
1      T008     GLENN MCGRATH  ASSOCIATE PROFESSOR         160000
2      T001       WASIM AKRAM  ASSOCIATE PROFESSOR         200000
3      T004  SHAKIB UL HASSAN             LECTURER         100000
4      T006        BEN STOKES             LECTURER         130000
5      T003         KAPEL DEV            PROFESSOR         230000
6      T002        IMRAN KHAN            PROFESSOR         250000
7      T007        DALE STAYN      SENIOR LECTURER         120000

In [10]:
query3 = '''select s.studentname, e.* 
from student s, enrolment e 
where s.studentid = e.studentid
and e.studyyear = 2010 or e.studyyear = 2020 or e.studyyear = 2022
order by e.studyyear, e.semester'''


df3 = pd.read_sql_query(query3, cnx)
print(df3)

          studentname ENROLMENTID SEMESTER  STUDYYEAR STUDENTID UNITCODE
0          BRIAN LARA        E004     FALL       2010      S002   MDS604
1       MICHAEL BEVAN        E002   SPRING       2020      S001   MDS601
2       MICHAEL BEVAN        E001   SPRING       2020      S001   MDS600
3          BRIAN LARA        E002   SPRING       2020      S001   MDS601
4          BRIAN LARA        E001   SPRING       2020      S001   MDS600
5      VIVAN RICHARDS        E002   SPRING       2020      S001   MDS601
6      VIVAN RICHARDS        E001   SPRING       2020      S001   MDS600
7       JAVED MIANDAD        E002   SPRING       2020      S001   MDS601
8       JAVED MIANDAD        E001   SPRING       2020      S001   MDS600
9         VIRAT KOHLI        E002   SPRING       2020      S001   MDS601
10        VIRAT KOHLI        E001   SPRING       2020      S001   MDS600
11         BABAR AZAM        E002   SPRING       2020      S001   MDS601
12         BABAR AZAM        E001   SPRING       2020      S001   MDS600
13  KUMARAN SANGAKARA        E002   SPRING       2020      S001   MDS601
14  KUMARAN SANGAKARA        E001   SPRING       2020      S001   MDS600
15      MICHAEL BEVAN        E006   WINTER       2020      S004   MDS606
16         BRIAN LARA        E006   WINTER       2020      S004   MDS606
17     VIVAN RICHARDS        E006   WINTER       2020      S004   MDS606
18      JAVED MIANDAD        E006   WINTER       2020      S004   MDS606
19        VIRAT KOHLI        E006   WINTER       2020      S004   MDS606
20         BABAR AZAM        E006   WINTER       2020      S004   MDS606
21  KUMARAN SANGAKARA        E006   WINTER       2020      S004   MDS606
22      MICHAEL BEVAN        E008     FALL       2022      S006   MDS600
23         BRIAN LARA        E008     FALL       2022      S006   MDS600
24     VIVAN RICHARDS        E008     FALL       2022      S006   MDS600
25      JAVED MIANDAD        E008     FALL       2022      S006   MDS600
26        VIRAT KOHLI        E008     FALL       2022      S006   MDS600
27         BABAR AZAM        E008     FALL       2022      S006   MDS600
28  KUMARAN SANGAKARA        E008     FALL       2022      S006   MDS600

In [13]:
query4 = '''select studentname
from student s, enrolment e, unit u 
where e.studentid = e.studentid and e.unitcode = u.unitcode 
and u.unitcode = 'MDS601'
union all 
select studentname
from student s, enrolment e, unit u 
where e.studentid = e.studentid and e.unitcode = u.unitcode 
and u.unitcode = 'MDS603'
'''

df4 = pd.read_sql_query(query4, cnx)
print(df4)

          studentname
0       MICHAEL BEVAN
1       MICHAEL BEVAN
2          BRIAN LARA
3          BRIAN LARA
4      VIVAN RICHARDS
5      VIVAN RICHARDS
6       JAVED MIANDAD
7       JAVED MIANDAD
8         VIRAT KOHLI
9         VIRAT KOHLI
10         BABAR AZAM
11         BABAR AZAM
12  KUMARAN SANGAKARA
13  KUMARAN SANGAKARA
14      MICHAEL BEVAN
15      MICHAEL BEVAN
16         BRIAN LARA
17         BRIAN LARA
18     VIVAN RICHARDS
19     VIVAN RICHARDS
20      JAVED MIANDAD
21      JAVED MIANDAD
22        VIRAT KOHLI
23        VIRAT KOHLI
24         BABAR AZAM
25         BABAR AZAM
26  KUMARAN SANGAKARA
27  KUMARAN SANGAKARA

In [14]:
query5 = '''select studentname
from student s, enrolment e, unit u 
where e.studentid = e.studentid and e.unitcode = u.unitcode 
and u.unitcode = 'MDS601'
union 
select studentname
from student s, enrolment e, unit u 
where e.studentid = e.studentid and e.unitcode = u.unitcode 
and u.unitcode = 'MDS603'
'''

df5 = pd.read_sql_query(query5, cnx)
print(df5)

         studentname
0      MICHAEL BEVAN
1         BRIAN LARA
2     VIVAN RICHARDS
3      JAVED MIANDAD
4        VIRAT KOHLI
5         BABAR AZAM
6  KUMARAN SANGAKARA

In [17]:
#Write a Python script to display the unit codes for the units that were offered in the 
#spring of 2020 and fall of 2022. You can use IN.


query6 = '''select unitcode
from enrolment 
where semester = 'spring' and studyyear = 2020
union 
select unitcode
from enrolment 
where semester = 'fall' and studyyear = 2022;
'''

df6 = pd.read_sql_query(query6, cnx)
print(df6)

  unitcode
0   MDS600
1   MDS601

In [18]:
#Write a Python script to display the unit codes for the units that were offered in the 
#spring of 2020 but not in the fall of 2022. You can use NOT IN

query7 = '''select distinct unitcode  
from enrolment 
where semester = 'spring' and studyyear = 2020
and unitcode not in (select distinct unitcode  
from enrolment 
where semester = 'fall' and studyyear = 2022);
'''

df7 = pd.read_sql_query(query7, cnx)
print(df7)

  unitcode
0   MDS601